# Токен бота вашего бота
PrimoTester_bot_token = "1234567890:ABCDep9rLWQYhhb8un567sEO5oZcJhf9zG"

# Пароль от базы данных пользователей
db_password = "PasswordOfBD"


# Айди забанненых пользователей
ban_list = {
    1234567890: "Имя1",
    0123456789: "Имя2",
}


# Айди администраторов бота
important_adm_id = {
    0000000000: "Имя1",     # @user1
    1111111111: "Имя2",    # @user2
    2222222222: "Имя3",     # @user3
}


# Айди групп-администраторов
important_group_id = {
    -1000000000000: "Чат1",
    -1111111111111: "Чат2",
}
