# MySQL/list_ids.py
# Хранилище забанненых и важных пользователей и чатов

# Айди забанненых пользователей
ban_list_ids = {
    6666666666666: "Лох",    # @username_ban1
    # 6751720805: "Лейн",      # @verdise
}


# Айди администраторов бота
important_adm_ids = {
    6751720805: "Лейн",  # @verdise
    7051557370: "Рикси",  # @exetreon
    1570652377: "Риша",  # @ariinwx
    1398573474: "Финаки",  # @fin_aki
    1851081467: "Финик",  # @Huuuvs
    929782381: "Хиде",  # @tghjudy
    6714237814: "Слешик",   # @Slashichan
}


# Айди групп-администраторов
important_groups_ids = {
    1087968824: "GroupAnonymousBot",
    -1002247934490: "Сплетни_лавочек",
    -1002124483077: "Труба_Сквад",
    -1002123850090: "Тест_Чат",
    -1001552311087: "Все_Будет_Хорошо",
}


# Айди важных пользователей бота
important_users_list_ids = {
    7145369362: "Артур",  # @i_toksichen
    1219440132: "Данил",  # @ohwtfuck
    1443833264: "Виктор",  # @B500OP98
    5424384921: "Олег",  # @s1s2s3sf
    556943853: "Ваня",  # @skodaracing24
    1295708467: "Степан",  # @No_step_toback
}


# Айди важных каналов
important_channel_ids = {
   # 7145369362: "Артур",  # @i_toksichen
}
